#### Setting up Colab

To run this notebook on [Google's Colab](https://colab.research.google.com), you will need to perform the following steps.

In [1]:
!pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.3.0.tar.gz (281.3 MB)
     |████████████████████████████████| 281.3 MB 46 kB/s
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     |████████████████████████████████| 199 kB 56.2 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.3.0-py2.py3-none-any.whl size=281764026 sha256=ed7f1d62fb5d9683302bb143680b45a7a60eb6bc24f8813c1cfcf6975cc73d4d
  Stored in directory: /root/.cache/pip/wheels/7a/8e/1b/f73a52650d2e5f337708d9f6a1750d451a7349a867f928b885
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.0

In [2]:
!pip install composable

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting composable
  Downloading composable-0.2.5-py3-none-any.whl (7.3 kB)
Collecting toolz<0.12.0,>=0.11.1
  Downloading toolz-0.11.2-py3-none-any.whl (55 kB)
     |████████████████████████████████| 55 kB 3.1 MB/s
Collecting python-forge<19.0,>=18.6
  Downloading python_forge-18.6.0-py35-none-any.whl (31 kB)
Installing collected packages: toolz, python-forge, composable
  Attempting uninstall: toolz
    Found existing installation: toolz 0.12.0
    Uninstalling toolz-0.12.0:
      Successfully uninstalled toolz-0.12.0
Successfully installed composable-0.2.5 python-forge-18.6.0 toolz-0.11.2

Step 2. Download and unzip the data

Next, the easiest way to access the data from the module is to download and unzip.

In [3]:
!wget https://github.com/wsu-stat489/module5_intro_to_pyspark/raw/main/data.zip

--2022-10-11 14:16:35--  https://github.com/wsu-stat489/module5_intro_to_pyspark/raw/main/data.zip
Resolving github.com (github.com)... 192.30.255.112
Connecting to github.com (github.com)|192.30.255.112|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/wsu-stat489/module5_intro_to_pyspark/main/data.zip [following]
--2022-10-11 14:16:36--  https://raw.githubusercontent.com/wsu-stat489/module5_intro_to_pyspark/main/data.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.110.133, 185.199.111.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 14959102 (14M) [application/zip]
Saving to: ‘data.zip’

data.zip            100%[===================>]  14.27M  --.-KB/s    in 0.1s

2022-10-11 14:16:37 (146 MB/s) - ‘data.zip’ saved [14959102/14959102]

In [4]:
!unzip data.zip

Archive:  data.zip
   creating: data/
  inflating: __MACOSX/._data
  inflating: data/Rochester_temps_2019.xlsx
  inflating: __MACOSX/data/._Rochester_temps_2019.xlsx
  inflating: data/uber-raw-data-jun14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-jun14-sample.csv
  inflating: data/heroes_information.csv
  inflating: __MACOSX/data/._heroes_information.csv
  inflating: data/employee.csv
  inflating: __MACOSX/data/._employee.csv
  inflating: data/uber-raw-data-apr14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-apr14-sample.csv
   creating: data/baseball/
  inflating: __MACOSX/data/._baseball
  inflating: data/uber-raw-data-may14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-may14-sample.csv
  inflating: data/auto_sales_apr.csv
  inflating: __MACOSX/data/._auto_sales_apr.csv
  inflating: data/uber-raw-data-sep14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-sep14-sample.csv
  inflating: data/department.csv
  inflating: __MACOSX/data/._department.csv
  inflating: data/PEW_income_religion.csv
  inflating: __MACOSX/data/._PEW_income_religion.csv
  inflating: data/health_survey.csv
  inflating: __MACOSX/data/._health_survey.csv
  inflating: data/TB_bad.csv
  inflating: __MACOSX/data/._TB_bad.csv
  inflating: data/uber-raw-data-aug14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-aug14-sample.csv
  inflating: data/uber-raw-data-jul14-sample.csv
  inflating: __MACOSX/data/._uber-raw-data-jul14-sample.csv
  inflating: data/auto_sales_may.csv
  inflating: __MACOSX/data/._auto_sales_may.csv
  inflating: data/auto_sales.csv
  inflating: __MACOSX/data/._auto_sales.csv
  inflating: data/Rochester_temps_2019.csv
  inflating: __MACOSX/data/._Rochester_temps_2019.csv
   creating: data/baseball/core/
  inflating: __MACOSX/data/baseball/._core
  inflating: data/baseball/README.txt
  inflating: __MACOSX/data/baseball/._README.txt
   creating: data/baseball/upstream/
  inflating: __MACOSX/data/baseball/._upstream
  inflating: data/baseball/core/AwardsManagers.csv
  inflating: __MACOSX/data/baseball/core/._AwardsManagers.csv
  inflating: data/baseball/core/Managers.csv
  inflating: __MACOSX/data/baseball/core/._Managers.csv
  inflating: data/baseball/core/AwardsPlayers.csv
  inflating: __MACOSX/data/baseball/core/._AwardsPlayers.csv
  inflating: data/baseball/core/Fielding.csv
  inflating: __MACOSX/data/baseball/core/._Fielding.csv
  inflating: data/baseball/core/Salaries.csv
  inflating: __MACOSX/data/baseball/core/._Salaries.csv
  inflating: data/baseball/core/Parks.csv
  inflating: __MACOSX/data/baseball/core/._Parks.csv
  inflating: data/baseball/core/Schools.csv
  inflating: __MACOSX/data/baseball/core/._Schools.csv
  inflating: data/baseball/core/People.csv
  inflating: __MACOSX/data/baseball/core/._People.csv
  inflating: data/baseball/core/PitchingPost.csv
  inflating: __MACOSX/data/baseball/core/._PitchingPost.csv
  inflating: data/baseball/core/Teams.csv
  inflating: __MACOSX/data/baseball/core/._Teams.csv
  inflating: data/baseball/core/Appearances.csv
  inflating: __MACOSX/data/baseball/core/._Appearances.csv
  inflating: data/baseball/core/AwardsSharePlayers.csv
  inflating: __MACOSX/data/baseball/core/._AwardsSharePlayers.csv
  inflating: data/baseball/core/TeamsFranchises.csv
  inflating: __MACOSX/data/baseball/core/._TeamsFranchises.csv
  inflating: data/baseball/core/Batting.csv
  inflating: __MACOSX/data/baseball/core/._Batting.csv
  inflating: data/baseball/core/ManagersHalf.csv
  inflating: __MACOSX/data/baseball/core/._ManagersHalf.csv
  inflating: data/baseball/core/FieldingOF.csv
  inflating: __MACOSX/data/baseball/core/._FieldingOF.csv
  inflating: data/baseball/core/Pitching.csv
  inflating: __MACOSX/data/baseball/core/._Pitching.csv
  inflating: data/baseball/core/CollegePlaying.csv
  inflating: __MACOSX/data/baseball/core/._CollegePlaying.csv
  inflating: data/baseball/core/HomeGames.csv
  inflating: __MACOSX/data/baseball/core/._HomeGames.csv
  inflating: data/baseball/core/HallOfFame.csv
  inflating: __MACOSX/data/baseball/core/._HallOfFame.csv
  inflating: data/baseball/core/readme2014.txt
  inflating: __MACOSX/data/baseball/core/._readme2014.txt
  inflating: data/baseball/core/AwardsShareManagers.csv
  inflating: __MACOSX/data/baseball/core/._AwardsShareManagers.csv
  inflating: data/baseball/core/BattingPost.csv
  inflating: __MACOSX/data/baseball/core/._BattingPost.csv
  inflating: data/baseball/core/TeamsHalf.csv
  inflating: __MACOSX/data/baseball/core/._TeamsHalf.csv
  inflating: data/baseball/core/SeriesPost.csv
  inflating: __MACOSX/data/baseball/core/._SeriesPost.csv
  inflating: data/baseball/core/FieldingPost.csv
  inflating: __MACOSX/data/baseball/core/._FieldingPost.csv
  inflating: data/baseball/core/AllstarFull.csv
  inflating: __MACOSX/data/baseball/core/._AllstarFull.csv
  inflating: data/baseball/core/FieldingOFsplit.csv
  inflating: __MACOSX/data/baseball/core/._FieldingOFsplit.csv
  inflating: data/baseball/upstream/Teams.csv
  inflating: __MACOSX/data/baseball/upstream/._Teams.csv

In [5]:
!wget https://github.com/wsu-stat489/module5_intro_to_pyspark/raw/main/more_pyspark.py

--2022-10-11 14:16:37--  https://github.com/wsu-stat489/module5_intro_to_pyspark/raw/main/more_pyspark.py
Resolving github.com (github.com)... 192.30.255.112
Connecting to github.com (github.com)|192.30.255.112|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/wsu-stat489/module5_intro_to_pyspark/main/more_pyspark.py [following]
--2022-10-11 14:16:38--  https://raw.githubusercontent.com/wsu-stat489/module5_intro_to_pyspark/main/more_pyspark.py
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 2786 (2.7K) [text/plain]
Saving to: ‘more_pyspark.py’

more_pyspark.py     100%[===================>]   2.72K  --.-KB/s    in 0s

2022-10-11 14:16:38 (44.3 MB/s) - ‘more_pyspark.py’ saved [2786/2786]

# Stacking and Unstacking data in `pyspark`

## Welcome back to developer's corner

While `pyspark` doesn't provide explicit methods for these two actions, we will be able to accomplish each operation using a combination of methods.  In this lecture, we will 

1. Build up expressions for stacking and unstacking a `pyspark df` 
2. Create helper functions for each operation to automate these processes.

#### `pyspark` setup

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Ops').config('spark.driver.host', 'localhost').getOrCreate()

22/10/27 22:55:42 WARN Utils: Your hostname, nn1448lr222 resolves to a loopback address: 127.0.1.1; using 172.17.25.238 instead (on interface eth0)
22/10/27 22:55:42 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/10/27 22:55:44 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4042. Attempting port 4043.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4043. Attempting port 4044.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4044. Attempting port 4045.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4045. Attempting port 4046.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4046. Attempting port 4047.
22/10/27 22:55:45 WARN Utils: Service 'SparkUI' could not bind on port 4047. Attempting port 4048.

In [2]:
from more_pyspark import to_pandas
sales = spark.read.csv("./data/auto_sales.csv",  
                       header=True, 
                       inferSchema=True)
sales.collect() >> to_pandas

  Salesperson  Compact  Sedan   SUV  Truck
0         Ann       22     18  15.0     12
1         Bob       19     12  17.0     20
2        Doug       20     13   NaN     20
3     Yolanda       19      8  32.0     15
4      Xerxes       12     23  18.0      9

## Stacking data in `pyspark`

Two step process

1. Combine the columns to be stacked into an array
2. Explode the array

[Source](https://www.mien.in/2018/03/25/reshaping-dataframe-using-pivot-and-melt-in-apache-spark-and-pandas/)

#### A helper function that combines multiple column entries into a column array

In [3]:
from pyspark.sql.functions import array, explode, struct, lit, col
make_array = lambda var_name, val_name, cols: (array(*(struct(lit(c).alias(var_name), 
                                                              col(c).alias(val_name))
                                                       for c in cols)))

sales_cols = ['Compact','Sedan', 'SUV', 'Truck']
make_array('car_type', 'qtr_sales', sales_cols)

Column<'array(struct(Compact AS car_type, Compact AS qtr_sales), struct(Sedan AS car_type, Sedan AS qtr_sales), struct(SUV AS car_type, SUV AS qtr_sales), struct(Truck AS car_type, Truck AS qtr_sales))'>

#### Testing `make_array`

In [4]:
from pyspark.sql.functions import array, explode, struct, lit, col, collect_list
(sales
 .withColumn('sales', 
             make_array('car_type', 
                        'qtr_sales', 
                        sales_cols))
 .collect()) >> to_pandas

,Salesperson,Compact,Sedan,SUV,Truck,sales
0,Ann,22,18,15.0,12,"[(Compact, 22), (Sedan, 18), (SUV, 15), (Truck..."
1,Bob,19,12,17.0,20,"[(Compact, 19), (Sedan, 12), (SUV, 17), (Truck..."
2,Doug,20,13,NaN,20,"[(Compact, 20), (Sedan, 13), (SUV, None), (Tru..."
3,Yolanda,19,8,32.0,15,"[(Compact, 19), (Sedan, 8), (SUV, 32), (Truck,..."
4,Xerxes,12,23,18.0,9,"[(Compact, 12), (Sedan, 23), (SUV, 18), (Truck..."

#### `explode` the contents to the array column to stack entries

In [5]:
t = (sales
    .withColumn('sales', 
                make_array('car_type', 
                           'qtr_sales', 
                           sales_cols))
    .withColumn("vars_and_vals", explode(col('sales'))))
t.take(3) >> to_pandas

,Salesperson,Compact,Sedan,SUV,Truck,sales,vars_and_vals
0,Ann,22,18,15,12,"[(Compact, 22), (Sedan, 18), (SUV, 15), (Truck...","(Compact, 22)"
1,Ann,22,18,15,12,"[(Compact, 22), (Sedan, 18), (SUV, 15), (Truck...","(Sedan, 18)"
2,Ann,22,18,15,12,"[(Compact, 22), (Sedan, 18), (SUV, 15), (Truck...","(SUV, 15)"

#### Checking out the schema of the result

Note that the exploded entries are named `'car_type'` and `'qtr_sales'`

In [6]:
t.printSchema()

root
 |-- Salesperson: string (nullable = true)
 |-- Compact: integer (nullable = true)
 |-- Sedan: integer (nullable = true)
 |-- SUV: integer (nullable = true)
 |-- Truck: integer (nullable = true)
 |-- sales: array (nullable = false)
 |    |-- element: struct (containsNull = false)
 |    |    |-- car_type: string (nullable = false)
 |    |    |-- qtr_sales: integer (nullable = true)
 |-- vars_and_vals: struct (nullable = false)
 |    |-- car_type: string (nullable = false)
 |    |-- qtr_sales: integer (nullable = true)

#### Testing extraction of tuple entries

In [7]:
t = (t
 .withColumn('types', t['vars_and_vals'].getItem("car_type"))
 .withColumn('sales', t['vars_and_vals'].getItem("qtr_sales")))
t.take(3) >> to_pandas

  Salesperson  Compact  Sedan  SUV  Truck  sales  vars_and_vals    types
0         Ann       22     18   15     12     22  (Compact, 22)  Compact
1         Ann       22     18   15     12     18    (Sedan, 18)    Sedan
2         Ann       22     18   15     12     15      (SUV, 15)      SUV

#### Dropping extra columns

In [8]:
t = (t
 .drop(*sales_cols)
 .drop('vars_and_vals'))
t.take(3) >> to_pandas

  Salesperson  sales    types
0         Ann     22  Compact
1         Ann     18    Sedan
2         Ann     15      SUV

####  Putting it all together with generic names

In [9]:
cols_to_stack = sales_cols
var_lbl = 'car_type'
val_lbl = 'qtr_sales'
(sales
 .withColumn('var_val_array', 
             make_array(var_lbl, 
                        val_lbl, 
                        cols_to_stack))
 .withColumn("vars_and_vals", explode(col('var_val_array')))
 .withColumn(var_lbl, col("vars_and_vals").getItem(var_lbl))
 .withColumn(val_lbl, col("vars_and_vals").getItem(val_lbl))
 .drop(*(cols_to_stack + ['var_val_array', "vars_and_vals"]))
 .collect()) >> to_pandas

   Salesperson car_type  qtr_sales
0          Ann  Compact       22.0
1          Ann    Sedan       18.0
2          Ann      SUV       15.0
3          Ann    Truck       12.0
4          Bob  Compact       19.0
5          Bob    Sedan       12.0
6          Bob      SUV       17.0
7          Bob    Truck       20.0
8         Doug  Compact       20.0
9         Doug    Sedan       13.0
10        Doug      SUV        NaN
11        Doug    Truck       20.0
12     Yolanda  Compact       19.0
13     Yolanda    Sedan        8.0
14     Yolanda      SUV       32.0
15     Yolanda    Truck       15.0
16      Xerxes  Compact       12.0
17      Xerxes    Sedan       23.0
18      Xerxes      SUV       18.0
19      Xerxes    Truck        9.0

#### Building a `gather` functions

In [10]:
from composable import pipeable

cols_to_stack = sales_cols
var_lbl = 'car_type'
val_lbl = 'qtr_sales'

@pipeable
def gather(var_lbl, val_lbl, cols_to_stack, df):
    make_array = lambda var_name, val_name, cols: (array(*(struct(lit(c).alias(var_name), 
                                                                  col(c).alias(val_name))
                                                           for c in cols)))
    return (df
            .withColumn('var_val_array', 
                        make_array(var_lbl, 
                                   val_lbl, 
                                   cols_to_stack))
            .withColumn("vars_and_vals", explode(col('var_val_array')))
            .withColumn(var_lbl, col("vars_and_vals").getItem(var_lbl))
            .withColumn(val_lbl, col("vars_and_vals").getItem(val_lbl))
            .drop(*(cols_to_stack + ['var_val_array', "vars_and_vals"])))
sales_stacked = sales >> gather('car_type', 'qtr_sales', sales_cols)
sales_stacked.collect() >> to_pandas

   Salesperson car_type  qtr_sales
0          Ann  Compact       22.0
1          Ann    Sedan       18.0
2          Ann      SUV       15.0
3          Ann    Truck       12.0
4          Bob  Compact       19.0
5          Bob    Sedan       12.0
6          Bob      SUV       17.0
7          Bob    Truck       20.0
8         Doug  Compact       20.0
9         Doug    Sedan       13.0
10        Doug      SUV        NaN
11        Doug    Truck       20.0
12     Yolanda  Compact       19.0
13     Yolanda    Sedan        8.0
14     Yolanda      SUV       32.0
15     Yolanda    Truck       15.0
16      Xerxes  Compact       12.0
17      Xerxes    Sedan       23.0
18      Xerxes      SUV       18.0
19      Xerxes    Truck        9.0

## Unstacking columns in `pyspark` with `group_by` and `pivot`

In [11]:
(sales_stacked
 .groupBy('Salesperson')
 .pivot('car_type')
 .sum('qtr_sales')
 .collect()) >> to_pandas

  Salesperson  Compact   SUV  Sedan  Truck
0     Yolanda       19  32.0      8     15
1        Doug       20   NaN     13     20
2      Xerxes       12  18.0     23      9
3         Ann       22  15.0     18     12
4         Bob       19  17.0     12     20

#### Creating a `spread` helper function

In [12]:
from pyspark.sql.functions import array, explode, struct, lit, col

@pipeable
def spread(val_col, var_col, group_by_col, df):
    return  (df
             .groupBy(group_by_col)
             .pivot(val_col)
             .sum(var_col))
sales_unstacked = sales_stacked >> spread('car_type', 'qtr_sales', 'Salesperson')
sales_unstacked.take(5) >> to_pandas

  Salesperson  Compact   SUV  Sedan  Truck
0     Yolanda       19  32.0      8     15
1        Doug       20   NaN     13     20
2      Xerxes       12  18.0     23      9
3         Ann       22  15.0     18     12
4         Bob       19  17.0     12     20

## <font color="red"> Exercise 3 </font>
    
**Task:** Load the `Rochester_temps_2019.csv` data, contains data weather data for Rochester, MN. that is available at the [DNR website](https://www.dnr.state.mn.us/climate/historical/lcd.html?loc=rst). Note that `SM` and `AV` stand for *sum* and *average*, respectively.

1. Identify that problem with the current format.
2. Use `gather` and `spread` to fix the issue.

In [13]:
min_max = spark.read.csv("./data/Rochester_temps_2019.csv", header=True, inferSchema=True)
min_max.take(5) >> to_pandas

,ELEMENT,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,MEAN DAILY MAXIMUM,19.7,20.3,33.9,54.6,63.5,76.0,81.7,76.7,74.7,52.1,34.6,29.2
1,HIGHEST DAILY MAXIMUM,44.0,41.0,61.0,83.0,86.0,87.0,90.0,85.0,89.0,71.0,47.0,42.0
2,MEAN DAILY MINIMUM,4.4,2.4,17.9,35.1,44.3,56.5,62.6,56.7,55.5,35.6,21.5,13.9
3,LOWEST DAILY MINIMUM,-30.0,-15.0,-17.0,24.0,33.0,43.0,52.0,48.0,46.0,19.0,0.0,-8.0
4,AVERAGE DRY BULB,12.1,11.3,25.9,44.8,53.9,66.3,72.2,66.7,65.1,43.9,28.1,21.5

> *Measurement information in column labels and Measurments on the same individual across multiple row.

In [20]:
# Your code here
import calendar
upper_months = list(map(lambda s: s.upper(), calendar.month_abbr))
upper_months

( (min_max
    >> gather("Month", "Value", upper_months[1:])
    >> spread('ELEMENT', 'Value', 'Month')
  )
    .collect()
) >> to_pandas

,Month,NUM DAYS W MINIMUM <= 0°,AVERAGE DRY BULB,HIGHEST DAILY MAXIMUM,LOWEST DAILY MINIMUM,MEAN DAILY MAXIMUM,MEAN DAILY MINIMUM,MEAN DEW POINT,MEAN WET BULB,NUM DAYS W MAXIMUM <= 32°,NUM DAYS W MINIMUM <= 32°,NUM DAYS W MAXIMUM >= 90°
0,APR,0.0,44.8,83.0,24.0,54.6,35.1,NaN,NaN,0.0,11.0,0.0
1,OCT,0.0,43.9,71.0,19.0,52.1,35.6,NaN,NaN,1.0,14.0,0.0
2,NOV,1.0,28.1,47.0,0.0,34.6,21.5,22.6,26.4,12.0,29.0,0.0
3,FEB,15.0,11.3,41.0,-15.0,20.3,2.4,NaN,NaN,24.0,27.0,0.0
4,SEP,0.0,65.1,89.0,46.0,74.7,55.5,57.5,60.6,0.0,0.0,0.0
5,JAN,11.0,12.1,44.0,-30.0,19.7,4.4,8.3,11.3,25.0,31.0,0.0
6,AUG,0.0,66.7,85.0,48.0,76.7,56.7,57.8,61.1,0.0,0.0,0.0
7,MAR,6.0,25.9,61.0,-17.0,33.9,17.9,NaN,NaN,11.0,27.0,0.0
8,DEC,6.0,21.5,42.0,-8.0,29.2,13.9,18.3,21.6,17.0,31.0,0.0
9,JUN,0.0,66.3,87.0,43.0,76.0,56.5,55.2,59.9,0.0,0.0,0.0
10,JUL,0.0,72.2,90.0,52.0,81.7,62.6,64.3,67.3,0.0,0.0,1.0
11,MAY,0.0,53.9,86.0,33.0,63.5,44.3,43.0,48.2,0.0,0.0,0.0